Revit 2026 API

# BendingDetailAngularDimensionsMeasurementOptions Enumeration

---

Describes the angular dimension measurement options.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum BendingDetailAngularDimensionsMeasurementOptions
```
```vb
Public Enumeration BendingDetailAngularDimensionsMeasurementOptions
```
```cpp
public enum class BendingDetailAngularDimensionsMeasurementOptions
```
```fsharp
type BendingDetailAngularDimensionsMeasurementOptions
```

| Member name | Value | Description |
| --- | --- | --- |
| Inside | 0 | Measure the angle inside the segments. |
| Outside | 1 | Measure the angle outside of the segments. |

#### Reference

Autodesk.Revit.DB.Structure Namespace